{
  "cid": "bafkreibsv3kwtrlkob2nzudlmhpql2fpdxtv7ezommob7rqhiqji5elh6i",
  "count": 3,
  "timestamp": "2025-12-20T07:39:30.875437",
  "examples": [
    {
      "chunk_text": "Albert Einstein (14 March 1879 – 18 April 1955) was a German-born theoretical physicist best known for developing the theory of relativity. Einstein also made important contributions to quantum theory. His mass–energy equivalence formula E = mc2, which arises from special relativity, has been called \"the world's most famous equation\". He received the 1921 Nobel Prize in Physics for \"his services to theoretical physics, and especially for his discovery of the law of the photoelectric effect\".\nBorn in the German Empire, Einstein moved to Switzerland in 1895, forsaking his German citizenship (as a subject of the Kingdom of Württemberg) the following year. In 1897, at the age of seventeen, he enrolled in the mathematics and physics teaching diploma program at the Swiss federal polytechnic school in Zurich, graduating in 1900. He acquired Swiss citizenship a year later, which he kept for the rest of his life, and afterwards secured a permanent position at the Swiss Patent Office in Bern. In 1905, he submitted a successful PhD dissertation to the University of Zurich. In 1914, he moved to Berlin to join the Prussian Academy of Sciences and the Humboldt University of Berlin, becoming director of the Kaiser Wilhelm Institute for Physics in 1917; he also became a German citizen again, this time as a subject of the Kingdom of Prussia. In 1933, while Einstein was visiting the United States, Adolf Hitler came to power in Germany. Horrified by the Nazi persecution of his fellow Jews, he decided to remain in the US, and was granted American citizenship in 1940. On the eve of World War II, he endorsed a letter to President Franklin D. Roosevelt alerting him to the potential German nuclear weapons program and recommending that the US begin similar research, later carried out as the Manhattan Project.",
      "section_context": "Albert Einstein > Introduction",
      "statements": [
        "Albert Einstein was a German-born theoretical physicist.",
        "Albert Einstein developed the theory of relativity.",
        "Albert Einstein made important contributions to quantum theory.",
        "Albert Einstein's mass–energy equivalence formula E = mc2 arises from special relativity.",
        "Albert Einstein received the 1921 Nobel Prize in Physics.",
        "Albert Einstein was born on 14 March 1879.",
        "Albert Einstein died on 18 April 1955.",
        "Albert Einstein was a subject of the Kingdom of Württemberg.",
        "Albert Einstein moved to Switzerland in 1895.",
        "Albert Einstein forsaking his German citizenship in 1896.",
        "Albert Einstein enrolled in the mathematics and physics teaching diploma program at the Swiss federal polytechnic school in Zurich in 1897.",
        "Albert Einstein graduated from the Swiss federal polytechnic school in Zurich in 1900.",
        "Albert Einstein acquired Swiss citizenship in 1901.",
        "Albert Einstein worked at the Swiss Patent Office in Bern.",
        "Albert Einstein submitted a successful PhD dissertation to the University of Zurich in 1905.",
        "Albert Einstein moved to Berlin in 1914.",
        "Albert Einstein joined the Prussian Academy of Sciences in 1914.",
        "Albert Einstein joined the Humboldt University of Berlin in 1914.",
        "Albert Einstein became director of the Kaiser Wilhelm Institute for Physics in 1917.",
        "Albert Einstein became a subject of the Kingdom of Prussia in 1914.",
        "Adolf Hitler came to power in Germany in 1933.",
        "Albert Einstein was visiting the United States in 1933.",
        "Albert Einstein decided to remain in the United States in 1933.",
        "Albert Einstein was granted American citizenship in 1940.",
        "Albert Einstein endorsed a letter to President Franklin D. Roosevelt in 1939.",
        "President Franklin D. Roosevelt was alerted to the potential German nuclear weapons program by Albert Einstein in 1939.",
        "Albert Einstein recommended that the United States begin similar nuclear research to that of Germany in 1939.",
        "The Manhattan Project was carried out as a result of Albert Einstein's recommendation in 1939."
      ]
    },
    {
      "chunk_text": "==== Relationship with Zionism ====\n\nEinstein was a figurehead leader in the establishment of the Hebrew University of Jerusalem, which opened in 1925. Earlier, in 1921, he was asked by the biochemist and president of the World Zionist Organization, Chaim Weizmann, to help raise funds for the planned university. He made suggestions for the creation of an Institute of Agriculture, a Chemical Institute and an Institute of Microbiology in order to fight the various ongoing epidemics such as malaria, which he called an \"evil\" that was undermining a third of the country's development. He also promoted the establishment of an Oriental Studies Institute, to include language courses given in both Hebrew and Arabic.\nEinstein was not a nationalist and opposed the creation of an independent Jewish state. He felt that the waves of arriving Jews of the Aliyah could live alongside existing Arabs in Palestine. The state of Israel was established without his help in 1948; Einstein was limited to a marginal role in the Zionist movement. Upon the death of Israeli president Weizmann in November 1952, Prime Minister David Ben-Gurion offered Einstein the largely ceremonial position of President of Israel at the urging of Ezriel Carlebach. The offer was presented by Israel's ambassador in Washington, Abba Eban, who explained that the offer \"embodies the deepest respect which the Jewish people can repose in any of its sons\". Einstein wrote that he was \"deeply moved\", but \"at once saddened and ashamed\" that he could not accept it. Einstein did not want the office, and Israel did not want him to accept, but felt obliged to make the offer. Yitzhak Navon, Ben-Gurion's political secretary, and later president, reports Ben-Gurion as saying \"Tell me what to do if he says yes! I've had to offer the post to him because it's impossible not to. But if he accepts, we are in for trouble.\"\n\n\n==== Religious and philosophical views ====",
      "section_context": "Albert Einstein > Life and career > Personal views > Relationship with Zionism",
      "statements": [
        "Albert Einstein was a figurehead leader in the establishment of the Hebrew University of Jerusalem.",
        "The Hebrew University of Jerusalem opened in 1925.",
        "In 1921, Albert Einstein was asked by Chaim Weizmann to help raise funds for the planned Hebrew University of Jerusalem.",
        "Chaim Weizmann was a biochemist and president of the World Zionist Organization.",
        "Albert Einstein made suggestions for the creation of an Institute of Agriculture at the Hebrew University of Jerusalem.",
        "Albert Einstein made suggestions for the creation of a Chemical Institute at the Hebrew University of Jerusalem.",
        "Albert Einstein made suggestions for the creation of an Institute of Microbiology at the Hebrew University of Jerusalem.",
        "Malaria was an ongoing epidemic that Albert Einstein called an \"evil\" undermining a third of the country's development.",
        "Albert Einstein promoted the establishment of an Oriental Studies Institute at the Hebrew University of Jerusalem.",
        "The Oriental Studies Institute included language courses given in both Hebrew and Arabic.",
        "Albert Einstein was not a nationalist.",
        "Albert Einstein opposed the creation of an independent Jewish state.",
        "Albert Einstein felt that the waves of arriving Jews of the Aliyah could live alongside existing Arabs in Palestine.",
        "The state of Israel was established in 1948.",
        "The state of Israel was established without the help of Albert Einstein.",
        "Albert Einstein was limited to a marginal role in the Zionist movement.",
        "Israeli president Chaim Weizmann died in November 1952.",
        "Prime Minister David Ben-Gurion offered Albert Einstein the largely ceremonial position of President of Israel.",
        "Prime Minister David Ben-Gurion was urged by Ezriel Carlebach to offer Albert Einstein the position of President of Israel.",
        "Israel's ambassador in Washington was Abba Eban.",
        "Abba Eban presented the offer of President of Israel to Albert Einstein.",
        "The offer of President of Israel embodied the deepest respect which the Jewish people could repose in any of its sons.",
        "Albert Einstein wrote that he was \"deeply moved\" by the offer of President of Israel.",
        "Albert Einstein wrote that he was \"at once saddened and ashamed\" that he could not accept the offer of President of Israel.",
        "Albert Einstein did not want the office of President of Israel.",
        "Israel did not want Albert Einstein to accept the offer of President of Israel.",
        "Yitzhak Navon was Ben-Gurion's political secretary and later president of Israel.",
        "Yitzhak Navon reported Prime Minister David Ben-Gurion as saying \"Tell me what to do if he says yes! I've had to offer the post to him because it's impossible not to. But if he accepts, we are in for trouble.\""
      ]
    },
    {
      "chunk_text": "In 1905, sometimes described as his annus mirabilis (miracle year), he published four groundbreaking papers. In them, he outlined a theory of the photoelectric effect, explained Brownian motion, introduced his special theory of relativity, and demonstrated that if the special theory is correct, mass and energy are equivalent to each other. In 1915, he proposed a general theory of relativity that extended his system of mechanics to incorporate gravitation. A paper that he published the following year laid out the implications of general relativity for the modeling of the structure and evolution of the universe as a whole. It introduced the cosmological constant and is further regarded as the first step in the field of modern theoretical cosmology. In 1917, Einstein wrote a paper which introduced the concepts of spontaneous emission and stimulated emission, the latter of which is the core mechanism behind the laser and maser, and which contained a trove of information that would be beneficial to developments in physics later on, such as quantum electrodynamics and quantum optics.\nIn the middle part of his career, Einstein made important contributions to statistical mechanics and quantum theory. Especially notable was his work on the quantum physics of radiation, in which light consists of particles, subsequently called photons. With physicist Satyendra Nath Bose, he laid the groundwork for Bose–Einstein statistics. For much of the last phase of his academic life, Einstein worked on two endeavors that ultimately proved unsuccessful. First, he advocated against quantum theory's introduction of fundamental randomness into science's picture of the world, objecting that \"God does not play dice\". Second, he attempted to devise a unified field theory by generalizing his geometric theory of gravitation to include electromagnetism. As a result, he became increasingly isolated from mainstream modern physics.",
      "section_context": "Albert Einstein > Introduction",
      "statements": [
        "In 1905, Albert Einstein published four groundbreaking papers.",
        "In 1905, the year 1905 is sometimes described as Albert Einstein's annus mirabilis.",
        "In 1905, Albert Einstein outlined a theory of the photoelectric effect in one of his four groundbreaking papers.",
        "In 1905, Albert Einstein explained Brownian motion in one of his four groundbreaking papers.",
        "In 1905, Albert Einstein introduced his special theory of relativity in one of his four groundbreaking papers.",
        "In 1905, Albert Einstein demonstrated that if the special theory of relativity is correct, mass and energy are equivalent to each other.",
        "In 1915, Albert Einstein proposed a general theory of relativity.",
        "In 1915, the general theory of relativity that Albert Einstein proposed extended his system of mechanics to incorporate gravitation.",
        "In 1916, Albert Einstein published a paper that laid out the implications of general relativity for the modeling of the structure and evolution of the universe as a whole.",
        "In 1916, the paper that Albert Einstein published introduced the cosmological constant.",
        "In 1916, the paper that Albert Einstein published is regarded as the first step in the field of modern theoretical cosmology.",
        "In 1917, Albert Einstein wrote a paper.",
        "In 1917, the paper that Albert Einstein wrote introduced the concepts of spontaneous emission and stimulated emission.",
        "In 1917, the concept of stimulated emission is the core mechanism behind the laser and maser.",
        "In 1917, the paper that Albert Einstein wrote contained information beneficial to developments in physics later on such as quantum electrodynamics and quantum optics.",
        "During the middle part of his career, Albert Einstein made important contributions to statistical mechanics.",
        "During the middle part of his career, Albert Einstein made important contributions to quantum theory.",
        "Especially notable during the middle part of his career was Albert Einstein's work on the quantum physics of radiation.",
        "In his work on the quantum physics of radiation, Albert Einstein proposed that light consists of particles.",
        "These particles that Albert Einstein proposed are subsequently called photons.",
        "With physicist Satyendra Nath Bose, Albert Einstein laid the groundwork for Bose–Einstein statistics.",
        "For much of the last phase of his academic life, Albert Einstein worked on two endeavors.",
        "The first endeavor that Albert Einstein advocated against was quantum theory's introduction of fundamental randomness into science's picture of the world.",
        "Albert Einstein objected to quantum theory's introduction of fundamental randomness by saying that \"God does not play dice\".",
        "The second endeavor that Albert Einstein attempted was to devise a unified field theory.",
        "The unified field theory that Albert Einstein attempted was based on generalizing his geometric theory of gravitation to include electromagnetism.",
        "As a result of his unsuccessful attempts, Albert Einstein became increasingly isolated from mainstream modern physics."
      ]
    }
  ]
}